{
  "architectures": [
    "ASTForAudioClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "frequency_stride": 10,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Finger_snapping",
    "1": "Squeak",
    "2": "Electric_piano",
    "3": "Harmonica",
    "4": "Snare_drum",
    "5": "Trumpet",
    "6": "Computer_keyboard",
    "7": "Clarinet",
    "8": "Laughter",
    "9": "Tearing",
    "10": "Applause",
    "11": "Shatter",
    "12": "Knock",
    "13": "Bass_drum",
    "14": "Cowbell",
    "15": "Glockenspiel",
    "16": "Double_bass",
    "17": "Fireworks",
    "18": "Writing",
    "19": "Cough",
    "20": "Saxophone",
    "21": "Bark",
    "22": "Keys_jangling",
    "23": "Flute",
    "24": "Meow",
    "25": "Oboe",
    "26": "Cello",
    "27": "Hi-hat",
    "28": "Fart",
    "29": "Burping_or_eructation",
    "30": "Drawer_open_or_close",
    "31": "Microwave_oven",
    "32": "Acoustic_guitar",
    "33": "Tambourine",
    "34": "Gong",
    "35": "Violin_or_fiddle",
    "36": "Gunshot_or_gunfire",
    "37": "Telephone",
    "38": "Bus",
    "39": "Scissors",
    "40": "Chime"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acoustic_guitar": 32,
    "Applause": 10,
    "Bark": 21,
    "Bass_drum": 13,
    "Burping_or_eructation": 29,
    "Bus": 38,
    "Cello": 26,
    "Chime": 40,
    "Clarinet": 7,
    "Computer_keyboard": 6,
    "Cough": 19,
    "Cowbell": 14,
    "Double_bass": 16,
    "Drawer_open_or_close": 30,
    "Electric_piano": 2,
    "Fart": 28,
    "Finger_snapping": 0,
    "Fireworks": 17,
    "Flute": 23,
    "Glockenspiel": 15,
    "Gong": 34,
    "Gunshot_or_gunfire": 36,
    "Harmonica": 3,
    "Hi-hat": 27,
    "Keys_jangling": 22,
    "Knock": 12,
    "Laughter": 8,
    "Meow": 24,
    "Microwave_oven": 31,
    "Oboe": 25,
    "Saxophone": 20,
    "Scissors": 39,
    "Shatter": 11,
    "Snare_drum": 4,
    "Squeak": 1,
    "Tambourine": 33,
    "Tearing": 9,
    "Telephone": 37,
    "Trumpet": 5,
    "Violin_or_fiddle": 35,
    "Writing": 18
  },
  "layer_norm_eps": 1e-12,
  "max_length": 1024,
  "model_type": "audio-spectrogram-transformer",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_mel_bins": 128,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "time_stride": 10,
  "torch_dtype": "float32",
  "transformers_version": "4.53.3"
}